_posts/soft/2018-05-03-通过css修改org-mode生成的begin_src代码颜色.html
---
date: 2018-05-03
tags: 
- begin_src
- html
- md
- color
- org
- mode
- css
author: yefeiyu
layout: post
title: 通过css修改org-mode生成的begin_src代码颜色
subtitle: 使用代码更好读
categories: 
- soft
extra-yaml-headers: theme: \nplugin: \nscheme-text: "#eeffee"\nscheme-link: "#ddffdd"\nscheme-hover: "#ffddff"\nscheme-code: "#ffeeff"\nscheme-bg: "#9400d3"\nscheme-hero-text: "#9400d3"\nscheme-hero-link: "#8b008b"\nscheme-hero-bg: "#ffccff"\nscheme-bg-light: \n
extra-yaml-headers: theme: \nplugin: \nscheme-text: "#8b4513"\nscheme-link: "#d2691e"\nscheme-hover: "#"\nscheme-code: "#"\nscheme-bg: "#ffeebd"\nscheme-hero-text: "#ffdead"\nscheme-hero-link: "#f4a460"\nscheme-hero-bg: "#8b4513"\nscheme-bg-light: true\n
---

<div id="outline-container-org20a9f45" class="outline-2">
<h2 id="org20a9f45"><span class="section-number-2">1</span> 通过babel方式在org-mode中插入代码</h2>
<div class="outline-text-2" id="text-1">
<p>
譬如 &lt;s-Tab可以生成
</p>
<pre class="example">
#+BEGIN_SRC c (or css or lisp or ruby)

#+END_SRC
</pre>
<p>
在其中插入代码。需要注意的是，不同的代码需要在'SRC'后面定义，如c或`lisp`。
</p>
</div>
</div>

<div id="outline-container-org06241e9" class="outline-2">
<h2 id="org06241e9"><span class="section-number-2">2</span> 通过M-x org-html-htmlize-generate-css在emacs中找到适合的颜色控制</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-css">&lt;style type="text/css"&gt;
    &lt;!--
      body {
	color: #000000;
	background-color: #ffffff;
      }
      .org-bold {
	/* bold */
	font-weight: bold;
      }
      .org-bold-italic {
	/* bold-italic */
	font-weight: bold;
	font-style: italic;
      }
      .org-border {
      }
      .org-buffer-menu-buffer {
	/* buffer-menu-buffer */
</pre>
</div>
<p>
拷贝至博客的css控制文件中。在本博客中是
</p>
<div class="org-src-container">
<pre class="src src-css">/home/xx/gh/yefeiyu.github.io/_app/assets/themes/curtana/_less/common.less
</pre>
</div>
<p>
文件。注意去年文件头&lt;style&gt;和尾。
</p>
</div>
</div>
<div id="outline-container-org9489cd3" class="outline-2">
<h2 id="org9489cd3"><span class="section-number-2">3</span> 可以进一步修改code基本颜色，</h2>
<div class="outline-text-2" id="text-3">
<p>
在
</p>
<div class="org-src-container">
<pre class="src src-css">/home/xx/gh/yefeiyu.github.io/_app/assets/themes/curtana/_less/variables.less
</pre>
</div>
<p>
文件中。
</p>
</div>
</div>

<div id="outline-container-orgaa6bb90" class="outline-2">
<h2 id="orgaa6bb90"><span class="section-number-2">4</span> 附加一个短引用的格式，org-mode中使用的</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>hello</code> Renders as verbatim
<code>hello</code> Renders as code
<code>hello'</code> Fails to render as verbatim
<code>hello'</code> Fails to render as code
</p>
<pre class="example">

=hello= Renders as verbatim
~hello~ Renders as code
=hello'= Fails to render as verbatim
~hello'~ Fails to render as code

</pre>
</div>
</div>
